<a href="https://colab.research.google.com/github/skyworld19/ds-school-advanced/blob/master/06_pandas_%EC%A0%84%EC%B2%98%EB%A6%AC_%EC%B6%94%EA%B0%80_%EC%82%AD%EC%A0%9C_%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B3%80%ED%99%98_LAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 패키지 설치

In [109]:
!pip install mySUNI

Requirement already satisfied: mySUNI in /usr/local/lib/python3.7/dist-packages (1.2.2)
Requirement already satisfied: tqdm in /usr/local/lib/python3.7/dist-packages (from mySUNI) (4.62.0)

## 모듈 import

In [110]:
import numpy as np
import pandas as pd
import seaborn as sns
from mySUNI import cds
from IPython.display import Image

## 데이터셋 로드

In [28]:
df = sns.load_dataset('titanic')
df.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

**컬럼(columns) 설명**

- survivied: 생존여부 (1: 생존, 0: 사망)
- pclass: 좌석 등급 (1등급, 2등급, 3등급)
- sex: 성별
- age: 나이
- sibsp: 형제 + 배우자 수
- parch: 부모 + 자녀 수
- fare: 좌석 요금
- embarked: 탑승 항구 (S, C, Q)
- class: pclass와 동일
- who: 성별과 동일
- adult_male: 성인 남자 여부
- deck: 데크 번호 (알파벳 + 숫자 혼용)
- embark_town: 탑승 항구 이름
- alive: 생존여부 (yes, no)
- alone: 혼자 탑승 여부

## 새로운 컬럼 추가

In [4]:
df1 = df.copy()

In [5]:
df1.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

임의의 값을 **대입**하여 새로운 컬럼을 추가할 수 있습니다.

In [6]:
# df1에 True로 채워진 'VIP' 컬럼을 추가합니다.
df1['VIP'] = True

In [7]:
df1.head()

   survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   VIP
0         0       3    male  22.0      1  ...   NaN  Southampton    no  False  True
1         1       1  female  38.0      1  ...     C    Cherbourg   yes  False  True
2         1       3  female  26.0      0  ...   NaN  Southampton   yes   True  True
3         1       1  female  35.0      1  ...     C  Southampton   yes  False  True
4         0       3    male  35.0      0  ...   NaN  Southampton    no   True  True

[5 rows x 16 columns]

## 삭제

삭제는 **행(row) 삭제와 열(column) 삭제**로 구분할 수 있습니다.

### 행 (row) 삭제

행 삭제시 **index를 지정하여 삭제**합니다.

In [9]:
# df1의 1번 행을 삭제합니다.
df1.drop(1)

     survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   VIP
0           0       3    male  22.0      1  ...   NaN  Southampton    no  False  True
2           1       3  female  26.0      0  ...   NaN  Southampton   yes   True  True
3           1       1  female  35.0      1  ...     C  Southampton   yes  False  True
4           0       3    male  35.0      0  ...   NaN  Southampton    no   True  True
5           0       3    male   NaN      0  ...   NaN   Queenstown    no   True  True
..        ...     ...     ...   ...    ...  ...   ...          ...   ...    ...   ...
886         0       2    male  27.0      0  ...   NaN  Southampton    no   True  True
887         1       1  female  19.0      0  ...     B  Southampton   yes   True  True
888         0       3  female   NaN      1  ...   NaN  Southampton    no  False  True
889         1       1    male  26.0      0  ...     C    Cherbourg   yes   True  True
890         0       3    male  32.0      0  ...   NaN   Queenstown    no   True  True

[890 rows x 16 columns]

행 삭제시 **범위(목록)를 지정하여 삭제**할 수 있습니다.

In [10]:
df1.index[0:10]

RangeIndex(start=0, stop=10, step=1)

In [11]:
# df1에서 0 ~ 9번 행을 삭제합니다
tuple(range(10))

(0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

In [12]:
# df1에서 0 ~ 9번 행을 삭제합니다
# list_like => range(10), list(range(10))
df1.drop(range(10))

     survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   VIP
10          1       3  female   4.0      1  ...     G  Southampton   yes  False  True
11          1       1  female  58.0      0  ...     C  Southampton   yes   True  True
12          0       3    male  20.0      0  ...   NaN  Southampton    no   True  True
13          0       3    male  39.0      1  ...   NaN  Southampton    no  False  True
14          0       3  female  14.0      0  ...   NaN  Southampton    no   True  True
..        ...     ...     ...   ...    ...  ...   ...          ...   ...    ...   ...
886         0       2    male  27.0      0  ...   NaN  Southampton    no   True  True
887         1       1  female  19.0      0  ...     B  Southampton   yes   True  True
888         0       3  female   NaN      1  ...   NaN  Southampton    no  False  True
889         1       1    male  26.0      0  ...     C    Cherbourg   yes   True  True
890         0       3    male  32.0      0  ...   NaN   Queenstown    no   True  True

[881 rows x 16 columns]

In [ ]:
삭제하는 이유
- 이상치 : 공식(IQR, 평균*표준편차), 그래프(boxplot, scatter)
- 날씨 : 2015년 -> 2021년 굉장한 차이가 있다, 이상치이다 - 의미가 있음 (삭제하지 않고 사용함)
- 제거할 Feature : 분산 0(같은 값으로만 구성됨), Feature1, Feature2 => -1이나 1에 가까운 상관관계를 보임

**fancy indexing**을 활용하여 삭제할 수 있습니다.

In [13]:
# df1에서 1, 3, 5, 7, 9 행을 삭제합니다
df1.drop([1,3,5,7,9])

     survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   VIP
0           0       3    male  22.0      1  ...   NaN  Southampton    no  False  True
2           1       3  female  26.0      0  ...   NaN  Southampton   yes   True  True
4           0       3    male  35.0      0  ...   NaN  Southampton    no   True  True
6           0       1    male  54.0      0  ...     E  Southampton    no   True  True
8           1       3  female  27.0      0  ...   NaN  Southampton   yes  False  True
..        ...     ...     ...   ...    ...  ...   ...          ...   ...    ...   ...
886         0       2    male  27.0      0  ...   NaN  Southampton    no   True  True
887         1       1  female  19.0      0  ...     B  Southampton   yes   True  True
888         0       3  female   NaN      1  ...   NaN  Southampton    no  False  True
889         1       1    male  26.0      0  ...     C    Cherbourg   yes   True  True
890         0       3    male  32.0      0  ...   NaN   Queenstown    no   True  True

[886 rows x 16 columns]

### 열 (column) 삭제

In [16]:
df1.head()

   survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   VIP
0         0       3    male  22.0      1  ...   NaN  Southampton    no  False  True
1         1       1  female  38.0      1  ...     C    Cherbourg   yes  False  True
2         1       3  female  26.0      0  ...   NaN  Southampton   yes   True  True
3         1       1  female  35.0      1  ...     C  Southampton   yes  False  True
4         0       3    male  35.0      0  ...   NaN  Southampton    no   True  True

[5 rows x 16 columns]

열 삭제시 **반드시 `axis=1` 옵션을 지정**해야 합니다. 2번째 위치에 지정시 `axis=`을 생략할 수 있습니다.

In [18]:
# df1의 'class' 열을 삭제하고, 앞에서부터 5개 데이터를 출력합니다.
df1.drop(columns='class', axis=1).head()

   survived  pclass     sex   age  sibsp  ...  deck  embark_town alive  alone   VIP
0         0       3    male  22.0      1  ...   NaN  Southampton    no  False  True
1         1       1  female  38.0      1  ...     C    Cherbourg   yes  False  True
2         1       3  female  26.0      0  ...   NaN  Southampton   yes   True  True
3         1       1  female  35.0      1  ...     C  Southampton   yes  False  True
4         0       3    male  35.0      0  ...   NaN  Southampton    no   True  True

[5 rows x 15 columns]

In [ ]:
df1.drop('class', 1).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone,VIP
0,0,3,male,22.0,1,0,7.2500,S,man,True,NaN,Southampton,no,False,True
1,1,1,female,38.0,1,0,71.2833,C,woman,False,C,Cherbourg,yes,False,True
2,1,3,female,26.0,0,0,7.9250,S,woman,False,NaN,Southampton,yes,True,True
3,1,1,female,35.0,1,0,53.1000,S,woman,False,C,Southampton,yes,False,True
4,0,3,male,35.0,0,0,8.0500,S,man,True,NaN,Southampton,no,True,True

**다수의 컬럼(column) 삭제**도 가능합니다.

In [19]:
# df1에서 'who', 'deck', 'alive' 열을 삭제합니다.
df1.drop(['who', 'deck', 'alive'], axis=1)

     survived  pclass     sex   age  ...  adult_male  embark_town  alone   VIP
0           0       3    male  22.0  ...        True  Southampton  False  True
1           1       1  female  38.0  ...       False    Cherbourg  False  True
2           1       3  female  26.0  ...       False  Southampton   True  True
3           1       1  female  35.0  ...       False  Southampton  False  True
4           0       3    male  35.0  ...        True  Southampton   True  True
..        ...     ...     ...   ...  ...         ...          ...    ...   ...
886         0       2    male  27.0  ...        True  Southampton   True  True
887         1       1  female  19.0  ...       False  Southampton   True  True
888         0       3  female   NaN  ...       False  Southampton  False  True
889         1       1    male  26.0  ...        True    Cherbourg   True  True
890         0       3    male  32.0  ...        True   Queenstown   True  True

[891 rows x 13 columns]

삭제된 내용을 바로 적용하려면 `inplace=True`를 지정합니다.

In [20]:
df1.drop(['who', 'deck', 'alive'], axis=1, inplace=True)

In [21]:
df1.head()

   survived  pclass     sex   age  ...  adult_male  embark_town  alone   VIP
0         0       3    male  22.0  ...        True  Southampton  False  True
1         1       1  female  38.0  ...       False    Cherbourg  False  True
2         1       3  female  26.0  ...       False  Southampton   True  True
3         1       1  female  35.0  ...       False  Southampton  False  True
4         0       3    male  35.0  ...        True  Southampton   True  True

[5 rows x 13 columns]

## 컬럼간 연산

**컬럼(column) 과 컬럼 사이의 연산을 매우 쉽게 적용**할 수 있습니다.

In [30]:
df1 = df.copy()

**family(가족)**의 총합은 **sibsp**컬럼과 **parch**의 합산으로 구할 수 있습니다.

In [31]:
# df1의 'sibsp' 컬럼과 'parch' 컬럼을 더하여 'family'라는 새로운 컬럼을 추가한다.
df1['family'] = df1['sibsp'] + df1['parch']

In [32]:
df1[['sibsp', 'parch', 'family']].head()

   sibsp  parch  family
0      1      0       1
1      1      0       1
2      0      0       0
3      1      0       1
4      0      0       0

**문자열의 합 (이어붙히기)도 가능**합니다.

In [33]:
# df1의 'who' 컬럼과 'sex' 컬럼을 중간에 '-'을 넣어 이어붙이고 
# 'gender'라는 이름의 컬럼으로 추가합니다.
df1['gender'] = df1['who'] + '-' + df1['sex']

In [ ]:
df1[['who', 'sex', 'gender']].head()

     who     sex        gender
0    man    male      man-male
1  woman  female  woman-female
2  woman  female  woman-female
3  woman  female  woman-female
4    man    male      man-male

컬럼간 연산시 `round()`를 사용하여 소수점 자릿수를 지정할 수 있습니다.

**round(숫자, 소수 몇 째자리)**

In [34]:
round(3.45612, 2), round(3.45612, 0), round(4236.789, -2)

(3.46, 3.0, 4200.0)

In [35]:
# df1의 'fare'를 'age'로나눈 값을 소수점 아래 두 자리까지 지정되도록 round 함수를 사용하여 처리하고,
# 'round'라는 컬럼으로 추가합니다.
df1['round'] = round(df1['fare']/df1['age'],2)

In [36]:
df1[['fare', 'age', 'round']].head()

      fare   age  round
0   7.2500  22.0   0.33
1  71.2833  38.0   1.88
2   7.9250  26.0   0.30
3  53.1000  35.0   1.52
4   8.0500  35.0   0.23

연산시 1개의 컬럼이라도 **NaN 값을 포함하고 있다면 결과는 NaN** 이 됩니다.

In [ ]:
df1.loc[df1['age'].isnull(), 'deck':].head()

   deck  embark_town alive  alone  family        gender  round
5   NaN   Queenstown    no   True       0      man-male    NaN
17  NaN  Southampton   yes   True       0      man-male    NaN
19  NaN    Cherbourg   yes   True       0  woman-female    NaN
26  NaN    Cherbourg    no   True       0      man-male    NaN
28  NaN   Queenstown   yes   True       0  woman-female    NaN

## 타입 변환 (astype)

In [37]:
df1 = df.copy()

In [38]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

`int32`로 변경

In [41]:
# df1의 'pclass' 컬럼에 대해 dtype을 'int32'로 변경하고 앞에서부터 5개 데이터 출력한다
df1['pclass'].astype('int32').head()

0    3
1    1
2    3
3    1
4    3
Name: pclass, dtype: int32

`float32`로 변경

In [42]:
# df1의 'pclass' 컬럼에 대해 dtype을 'float32'로 변경하고 앞에서부터 5개 데이터 출력한다
df1['pclass'].astype('float32').head()

0    3.0
1    1.0
2    3.0
3    1.0
4    3.0
Name: pclass, dtype: float32

`object`로 변경

In [43]:
# df1의 'pclass' 컬럼에 대해 dtype을 'str'로 변경하고 앞에서부터 5개 데이터 출력한다
df1['pclass'].astype('str').head()

0    3
1    1
2    3
3    1
4    3
Name: pclass, dtype: object

`category`로 변경.

`category`로 변경시에는 Categories가 같이 출력 됩니다.

In [44]:
# df1의 'who' 컬럼에 대해 값별 데이터 건수를 출력한다 (value_counts() 사용)
df1['who'].value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

In [45]:
# df1의 'who' 컬럼에 대한 dtype을 확인한다  (print 함수를 사용하지 않으면?)
print(df1['who'].dtype)

object

In [46]:
# df1의 'who' 컬럼에 대해 dtype을 'category'로 변경하고 앞에서부터 5개 데이터 출력한다
df1['who'].astype('category').head()

0      man
1    woman
2    woman
3    woman
4      man
Name: who, dtype: category
Categories (3, object): ['child', 'man', 'woman']

타입을 `category`로 변환했다면 **.cat**으로 접근하여 category 타입이 제공하는 **attribute를 사용**할 수 있습니다.

In [47]:
# df1의 'who' 컬럼에 대해 dtype을 'category'로 변경하여 갱신합니다. 
df1['who'] = df1['who'].astype('category')

In [48]:
df1['who'].dtype

CategoricalDtype(categories=['child', 'man', 'woman'], ordered=False)

In [49]:
# cat.codes 를 사용하여 숫자 값을 반환합니다. (child = 0, man = 1, woman = 2)
df1['who'].cat.codes

0      1
1      2
2      2
3      2
4      1
      ..
886    1
887    2
888    2
889    1
890    1
Length: 891, dtype: int8

In [50]:
df1['who_code'] = df1['who'].astype('category').cat.codes # Label Encoding - 범주형

In [51]:
df1.head()

   survived  pclass     sex   age  ...  embark_town  alive  alone who_code
0         0       3    male  22.0  ...  Southampton     no  False        1
1         1       1  female  38.0  ...    Cherbourg    yes  False        2
2         1       3  female  26.0  ...  Southampton    yes   True        2
3         1       1  female  35.0  ...  Southampton    yes  False        2
4         0       3    male  35.0  ...  Southampton     no   True        1

[5 rows x 16 columns]

**카테고리 이름 변경**

In [52]:
for g in df1['who'].cat.categories:
  print(g)

child
man
woman

In [53]:
["Group (%s)" % g for g in df1['who'].cat.categories]

['Group (child)', 'Group (man)', 'Group (woman)']

In [54]:
df1['who'].cat.categories = ["Group (%s)" % g for g in df1['who'].cat.categories]
df1['who'].value_counts()

Group (man)      537
Group (woman)    271
Group (child)     83
Name: who, dtype: int64

In [56]:
df1.head()

   survived  pclass     sex   age  ...  embark_town  alive  alone who_code
0         0       3    male  22.0  ...  Southampton     no  False        1
1         1       1  female  38.0  ...    Cherbourg    yes  False        2
2         1       3  female  26.0  ...  Southampton    yes   True        2
3         1       1  female  35.0  ...  Southampton    yes  False        2
4         0       3    male  35.0  ...  Southampton     no   True        1

[5 rows x 16 columns]

## datetime - 날짜, 시간

### data_range

주요 옵션 값
- **start**: 시작 날짜
- **end**: 끝 날짜
- **periods**: 생성할 데이터 개수
- **freq**: 주기

In [57]:
df.shape

(891, 15)

In [59]:
dates = pd.date_range('20210101', periods=df.shape[0], freq='15H')
dates[:5]

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 15:00:00',
               '2021-01-02 06:00:00', '2021-01-02 21:00:00',
               '2021-01-03 12:00:00'],
              dtype='datetime64[ns]', freq='15H')

In [60]:
df1 = df.copy()
df1.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [61]:
# date의 컬럼을 만들어 생성한 dates 를 df1에 'date' 컬럼을 추가합니다.
df1['date'] = dates
df1.head()

   survived  pclass     sex   age  ...  embark_town  alive  alone                date
0         0       3    male  22.0  ...  Southampton     no  False 2021-01-01 00:00:00
1         1       1  female  38.0  ...    Cherbourg    yes  False 2021-01-01 15:00:00
2         1       3  female  26.0  ...  Southampton    yes   True 2021-01-02 06:00:00
3         1       1  female  35.0  ...  Southampton    yes  False 2021-01-02 21:00:00
4         0       3    male  35.0  ...  Southampton     no   True 2021-01-03 12:00:00

[5 rows x 16 columns]

In [62]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  date         891 non-null    datetime64[ns]
dtypes: bool(2), category(2), datetime64[ns](1), float64(2), int64(4), object(5)
memory usage: 87.6+ KB

**date**의 컬럼에 `datetime64`라는 데이터 타입이 표기됩니다.

In [63]:
temp = pd.to_datetime('20210825')
temp

Timestamp('2021-08-25 00:00:00')

In [69]:
s = pd.Series(['20210825', '20210826', '20210827'])
s2 = pd.Series(['2021/08/25', '2021/08/26', '2021/08/27'])
s3 = pd.Series(['210825', '210826', '210827']) #형식이 위 2개랑 달라서 %Y가 아닌 %y로 해야 올바르게 나옴
temp = pd.to_datetime(s3, format='%Y%m%d', errors='ignore')
temp

0   2021-08-25
1   2021-08-26
2   2021-08-27
dtype: datetime64[ns]

### datetime 타입

`datetime` 타입에서는 **dt** 접근자로 다음과 같은 날짜 속성에 쉽게 접근할 수 있습니다.

Pandas의 **dt (datetime) 날짜 관련 변수**는 다음과 같습니다.

[도큐먼트](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DatetimeIndex.year.html)

- pandas.Series.dt.year: 연도
- pandas.Series.dt.month: 월
- pandas.Series.dt.day: 일
- pandas.Series.dt.hour: 시
- pandas.Series.dt.minute: 분
- pandas.Series.dt.second: 초
- pandas.Series.dt.microsecond: micro 초
- pandas.Series.dt.nanosecond: nano 초
- pandas.Series.dt.week: 주
- pandas.Series.dt.weekofyear: 연중 몇 째주
- pandas.Series.dt.dayofweek: 요일
- pandas.Series.dt.weekday: 요일 (dayofweek과 동일)
- pandas.Series.dt.dayofyear: 연중 몇 번째 날
- pandas.Series.dt.quarter: 분기

In [71]:
# df1의 'date'에서 년도 정보만 분리하여 처음부터 5개를 출력한다.
df1['date'].dt.year.head()

0    2021
1    2021
2    2021
3    2021
4    2021
Name: date, dtype: int64

In [72]:
df1['date'].dt.year.value_counts()  # 모두 같은 값인지 아닌지 확인함

2021    584
2022    307
Name: date, dtype: int64

In [73]:
df1['year'] = df1['date'].dt.year  # 다른 값이 섞여 있으므로 정보로 활용하기 위해 column 추가

In [75]:
# 월
df1['date'].dt.month.head()

0    1
1    1
2    1
3    1
4    1
Name: date, dtype: int64

In [77]:
df1['date'].dt.month.value_counts().sort_index()

1     100
2      90
3      98
4      96
5     100
6      96
7      67
8      49
9      48
10     50
11     48
12     49
Name: date, dtype: int64

In [76]:
# 일
df1['date'].dt.day.head()

0    1
1    1
2    2
3    2
4    3
Name: date, dtype: int64

**dayofweek**는 숫자로 요일이 표기 됩니다.
- 월요일: 0, 일요일: 6

In [78]:
# df1의 'date'에서 요일 정보만 분리하여 처음부터 10개를 출력한다.
df1['date'].dt.dayofweek.head(10)

0    4
1    4
2    5
3    5
4    6
5    0
6    0
7    1
8    2
9    2
Name: date, dtype: int64

In [80]:
df1['date'].dt.dayofweek.value_counts().sort_index()

0    127
1    127
2    126
3    127
4    128
5    128
6    128
Name: date, dtype: int64

### to_datetime

In [111]:
# e notation 표현 방식 변경
pd.options.display.float_format = '{:.2f}'.format

샘플용 **서울시 공공자전거 데이터를 로드**합니다.

In [112]:
cds.list_data()

            name  ...                                           filename
0         서울시자전거  ...                                [seoul_bicycle.csv]
1        서울시대중교통  ...                        [seoul_transportation.xlsx]
2      서울시주민등록인구  ...                             [seoul_population.csv]
3           유가정보  ...          [gas_first_2019.csv, gas_second_2019.csv]
4   PandasFileIO  ...  [mySUNI.xlsx, mySUNI_1.csv, mySUNI_2.csv, mySU...
5      CCTV데이터분석  ...  [01. CCTV_in_Seoul.csv, 01. population_in_Seou...
6      국민연금데이터분석  ...                             [national_pension.csv]
7    민간아파트가격동향분석  ...                            [seoul_house_price.csv]
8         실거래가분석  ...          [2020-seoul-apt-price.csv, loc_code.xlsx]
9         유가가격분석  ...          [gas_first_2019.csv, gas_second_2019.csv]
10     중고차판매정보분석  ...                                     [vehicles.csv]
11          신용정보  ...                                  [credit-data.csv]
12       전국신규분양가  ...                                  [house-price.csv]
13        에너지 효율  ...                                [ENB2012_data.xlsx]
14         보스턴집값  ...                                       [boston.csv]
15        와인유형분류  ...                     [red_wine.csv, white_wine.csv]
16       사용자이탈예측  ...    [class.csv, event.csv, logs.csv, user_info.csv]

[17 rows x 3 columns]

In [113]:
cds.download_data('서울시자전거')

파일 다운로드 완료
====================

데이터셋: 서울시자전거
파일경로: data/seoul_bicycle.csv

====================

In [121]:
df2 = pd.read_csv('data/seoul_bicycle.csv')
df2.head()

          대여일자  대여소번호      대여소명  대여구분코드  ...      운동량    탄소량      이동거리 이용시간
0  Jan-20-2020      3      중랑센터  일일(회원)  ...    61.82   0.52   2230.00   75
1  Jan-20-2020      3      중랑센터  일일(회원)  ...    39.62   0.28   1220.00   15
2  Jan-20-2020      3      중랑센터      정기  ...   430.85   4.01  17270.00   53
3  Jan-20-2020      5  상암센터 정비실  일일(회원)  ...     1.79   0.02     90.00   33
4  Jan-20-2020      5  상암센터 정비실      정기  ...  4501.96  45.47 196010.00   64

[5 rows x 11 columns]

In [85]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    327231 non-null  object
 1   대여소번호   327231 non-null  int64
 2   대여소명    327231 non-null  object
 3   대여구분코드  327231 non-null  object
 4   성별      272841 non-null  object
 5   연령대코드   327231 non-null  object
 6   이용건수    327231 non-null  int64
 7   운동량     327231 non-null  object
 8   탄소량     327231 non-null  object
 9   이동거리    327231 non-null  float64
 10  이용시간    327231 non-null  int64
dtypes: float64(1), int64(3), object(7)
memory usage: 27.5+ MB

**대여일자** 컬럼은 날짜 관련 컬럼처럼 보이나 `info()`는 object로 인식하였습니다.

`datetime`타입으로 변경해야 .dt 접근자를 사용할 수 있습니다.

**`pd.to_datetime()`**: datetime type으로 변환합니다.

In [87]:
# df2의 '대여일자' 컬럼을 datetime 타입으로 변경합니다.
#df2['대여일자'].astype('datetime64')
pd.to_datetime(df2['대여일자'])

0        2020-01-20
1        2020-01-20
2        2020-01-20
3        2020-01-20
4        2020-01-20
            ...
327226   2020-05-20
327227   2020-05-20
327228   2020-05-20
327229   2020-05-20
327230   2020-05-20
Name: 대여일자, Length: 327231, dtype: datetime64[ns]

재대입하여 **컬럼에 적용**합니다.

In [88]:
# df2의 '대여일자' 컬럼을 datetime 타입으로 변경하여 df2의 '대여일자'로 재대입합니다.
df2['대여일자'] = pd.to_datetime(df2['대여일자'])

In [89]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    327231 non-null  datetime64[ns]
 1   대여소번호   327231 non-null  int64
 2   대여소명    327231 non-null  object
 3   대여구분코드  327231 non-null  object
 4   성별      272841 non-null  object
 5   연령대코드   327231 non-null  object
 6   이용건수    327231 non-null  int64
 7   운동량     327231 non-null  object
 8   탄소량     327231 non-null  object
 9   이동거리    327231 non-null  float64
 10  이용시간    327231 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(6)
memory usage: 27.5+ MB

적용된 후 `.dt`접근자를 활용하여 datetime 속성에 접근할 수 있습니다.

In [90]:
# df2의 '대여일자'에서 요일(dayofweek) 정보를 확인합니다.
df2['대여일자'].dt.dayofweek

0         0
1         0
2         0
3         0
4         0
         ..
327226    2
327227    2
327228    2
327229    2
327230    2
Name: 대여일자, Length: 327231, dtype: int64

In [91]:
# df2의 '대여일자'에서 요일(weekday) 정보를 확인합니다.
df2['대여일자'].dt.weekday

0         0
1         0
2         0
3         0
4         0
         ..
327226    2
327227    2
327228    2
327229    2
327230    2
Name: 대여일자, Length: 327231, dtype: int64

## pd.to_numeric() - 수치형 변환

object나 numerical type이 아닌 컬럼을 **수치형(numerical) 컬럼으로 변환**할 때 사용합니다.

In [92]:
df2.head()

        대여일자  대여소번호      대여소명  대여구분코드  성별  ... 이용건수      운동량    탄소량      이동거리  이용시간
0 2020-01-20      3      중랑센터  일일(회원)   M  ...    3    61.82   0.52   2230.00    75
1 2020-01-20      3      중랑센터  일일(회원)   M  ...    1    39.62   0.28   1220.00    15
2 2020-01-20      3      중랑센터      정기   M  ...    3   430.85   4.01  17270.00    53
3 2020-01-20      5  상암센터 정비실  일일(회원)  \N  ...    2     1.79   0.02     90.00    33
4 2020-01-20      5  상암센터 정비실      정기   F  ...    1  4501.96  45.47 196010.00    64

[5 rows x 11 columns]

In [93]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    327231 non-null  datetime64[ns]
 1   대여소번호   327231 non-null  int64
 2   대여소명    327231 non-null  object
 3   대여구분코드  327231 non-null  object
 4   성별      272841 non-null  object
 5   연령대코드   327231 non-null  object
 6   이용건수    327231 non-null  int64
 7   운동량     327231 non-null  object
 8   탄소량     327231 non-null  object
 9   이동거리    327231 non-null  float64
 10  이용시간    327231 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(6)
memory usage: 27.5+ MB

**운동량** 컬럼은 숫자형 컬럼 처럼 보이지만, **object 타입으로 지정**되어 있습니다. 

종종 이런 현상이 발생하는데, 이런 현상을 만들어낸 이유는 분명 존재합니다!

원인 파악을 위해서 일단 `pd.to_numeric()`으로 **변환을 시도**합니다.

In [94]:
# df2의 '운동량' 컬럼을 숫자형으로 변경하여 봅니다.
pd.to_numeric(df2['운동량'])

ValueError: ignored

**2344 position**에 무언가 에러가 발생하였습니다.

In [95]:
# df2의 loc을 사용해서 2344 행의 내용을 확인합니다.
df2.iloc[2344, :]

대여일자      2020-01-20 00:00:00
대여소번호                     165
대여소명              165. 중앙근린공원
대여구분코드                 일일(회원)
성별                         \N
연령대코드                 AGE_003
이용건수                        1
운동량                        \N
탄소량                        \N
이동거리                     0.00
이용시간                       40
Name: 2344, dtype: object

운동량에 숫자형이 아닌 개행 (\N)이 들어가 있기 때문에 이러한 에러가 발생하였습니다.

숫자형으로 바꿀 때 **NaN값이나 숫자로 변환이 불가능한 문자열이 존재할 때 변환에 실패**하게 됩니다.

`errors=` 옵션 값을 바꾸어 해결할 수 있습니다.

errors : {'ignore', 'raise', 'coerce'}, default 'raise'
    - If 'raise', then invalid parsing will raise an exception
    - If 'coerce', then invalid parsing will be set as NaN
    - If 'ignore', then invalid parsing will return the input

`errors='coerce'`로 지정하면 잘못된 문자열은 **NaN 값으로 치환하여 변환**합니다. 

그리고, 결과 확인시 잘 변환이 된 것을 볼 수 있습니다.

In [117]:
# df2의 '운동량' 컬럼을 숫자형으로 변경합니다. 
# 이때 변경할 수 없는 것이 존재하면 NaN 값으로 치환하여 변환합니다.
temp = pd.to_numeric(df2['운동량'], errors='coerce')
temp

0          61.82
1          39.62
2         430.85
3           1.79
4        4501.96
           ...
327226    689.57
327227      0.00
327228     19.96
327229     43.77
327230   4735.63
Name: 운동량, Length: 327231, dtype: float64

In [97]:
# temp의 2344 위치의 값이 NaN으로 잘 변환되어 있는지 확인합니다.
temp[2344]

nan

`errors='ignore'`로 지정하게 되면 잘못된 문자열이 숫자로 **변환이 안되고 무시**하기 때문에 전체 컬럼의 dtype이 **object로 그대로 남아있습니다.**

In [98]:
# df2의 '운동량' 컬럼을 숫자형으로 변경합니다. 
# 이때 변경할 수 없는 것이 존재하면 변환하지 않고 무시되도록 합니다.
temp = pd.to_numeric(df2['운동량'], errors='ignore')
temp

0           61.82
1           39.62
2          430.85
3            1.79
4         4501.96
           ...
327226     689.57
327227          0
327228      19.96
327229      43.77
327230    4735.63
Name: 운동량, Length: 327231, dtype: object

In [99]:
# temp의 2344 위치의 값이 그대로 유지되었는지 확인합니다.
temp[2344]

'\\N'

재대입까지 마무리 해야 DataFrame에 적용됩니다.

In [122]:
# df2의 '운동량' 컬럼에 대해 숫자형으로 변경하여 (오류값을 NaN으로 처리) 재대입합니다.
df2['운동량'] = pd.to_numeric(df2['운동량'], errors='coerce')

In [123]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327231 entries, 0 to 327230
Data columns (total 11 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   대여일자    327231 non-null  object
 1   대여소번호   327231 non-null  int64
 2   대여소명    327231 non-null  object
 3   대여구분코드  327231 non-null  object
 4   성별      272841 non-null  object
 5   연령대코드   327231 non-null  object
 6   이용건수    327231 non-null  int64
 7   운동량     326830 non-null  float64
 8   탄소량     327231 non-null  object
 9   이동거리    327231 non-null  float64
 10  이용시간    327231 non-null  int64
dtypes: float64(2), int64(3), object(6)
memory usage: 27.5+ MB

## pd.cut() - 구간 나누기(binning)

연속된 수치(continuous values)를 **구간으로 나누어 카테고리화** 할 때 사용합니다.

In [ ]:
구간 - 정보를 줄임
80 85 87 89 82 : 80점대, B
과대적합 - 방지 
이상치 - 구간

In [102]:
df2.head()

        대여일자  대여소번호      대여소명  대여구분코드  성별  ... 이용건수     운동량    탄소량      이동거리  이용시간
0 2020-01-20      3      중랑센터  일일(회원)   M  ...    3   61.82   0.52   2230.00    75
1 2020-01-20      3      중랑센터  일일(회원)   M  ...    1   39.62   0.28   1220.00    15
2 2020-01-20      3      중랑센터      정기   M  ...    3  430.85   4.01  17270.00    53
3 2020-01-20      5  상암센터 정비실  일일(회원)  \N  ...    2    1.79   0.02     90.00    33
4 2020-01-20      5  상암센터 정비실      정기   F  ...    1 4501.96  45.47 196010.00    64

[5 rows x 11 columns]

In [103]:
df2.describe()

          대여소번호      이용건수          운동량        이동거리      이용시간
count 327231.00 327231.00    326830.00   327231.00 327231.00
mean    1288.41     23.62      6921.37   106881.09    752.81
std     1012.65     59.92    656482.34   463495.54   2647.38
min        3.00      1.00         0.00        0.00      0.00
25%      562.00      2.00       138.05     5290.00     66.00
50%     1204.00      6.00       601.71    22900.00    207.00
75%     1933.00     22.00      2481.17    93460.00    670.00
max    99999.00   7451.00 163936052.30 56709052.94 458960.00

운동량은 범위가 굉장히 넓습니다. **최소값은 0인데, 최대값은 엄청 큰 값**이 존재합니다.

어쨌든, 운동량을 기준으로 데이터를 10개 그룹으로 분류하고 싶습니다.

`pd.cut()`을 활용하여 쉽게 그룹을 나눌 수 있습니다.

In [104]:
df2.head()

        대여일자  대여소번호      대여소명  대여구분코드  성별  ... 이용건수     운동량    탄소량      이동거리  이용시간
0 2020-01-20      3      중랑센터  일일(회원)   M  ...    3   61.82   0.52   2230.00    75
1 2020-01-20      3      중랑센터  일일(회원)   M  ...    1   39.62   0.28   1220.00    15
2 2020-01-20      3      중랑센터      정기   M  ...    3  430.85   4.01  17270.00    53
3 2020-01-20      5  상암센터 정비실  일일(회원)  \N  ...    2    1.79   0.02     90.00    33
4 2020-01-20      5  상암센터 정비실      정기   F  ...    1 4501.96  45.47 196010.00    64

[5 rows x 11 columns]

`bins` 옵션에 나누고자 하는 **구간의 개수**를 설정합니다.

In [ ]:
#[0, 100, 200, 300, 500], ['A', 'B', 'C', 'D']  : bins의 개수가 labels의 개수보다 1개 더 많음

In [105]:
# df2의 '운동량' 컬럼에 대해서 10개 구간으로 분할하여
# '운동량_cut' 이라는 컬럼을 추가합니다.
df2['운동량_cut'] = pd.cut(df2['운동량'],10)

In [106]:
df2['운동량_cut'].head()

0    (-163936.052, 16393605.23]
1    (-163936.052, 16393605.23]
2    (-163936.052, 16393605.23]
3    (-163936.052, 16393605.23]
4    (-163936.052, 16393605.23]
Name: 운동량_cut, dtype: category
Categories (10, interval[float64]): [(-163936.052, 16393605.23] < (16393605.23, 32787210.46] <
                                     (32787210.46, 49180815.69] < (49180815.69, 65574420.92] < ... <
                                     (98361631.38, 114755236.61] < (114755236.61, 131148841.84] <
                                     (131148841.84, 147542447.07] < (147542447.07, 163936052.3]]

In [ ]:
[0.0, 16393605.23)
=> 0.0 포함, 16393605.23 포함하지 않는 범위

In [ ]:
(-163936.052, 16393605.23]    
=> -163936.052 포함하지 않음, 16393605.23 포함 하는 범위

In [107]:
# df2의 '운동량_cut' 컬럼의 분포를 확인합니다 (구간별 돗수확인)
df2['운동량_cut'].value_counts().sort_index()

(-163936.052, 16393605.23]      326816
(16393605.23, 32787210.46]           1
(32787210.46, 49180815.69]           2
(49180815.69, 65574420.92]           0
(65574420.92, 81968026.15]           0
(81968026.15, 98361631.38]           0
(98361631.38, 114755236.61]          9
(114755236.61, 131148841.84]         1
(131148841.84, 147542447.07]         0
(147542447.07, 163936052.3]          1
Name: 운동량_cut, dtype: int64

분포를 보니 첫 구간에 대부분의 데이터가 쏠려 있습니다. 딱봐도 올바르지 않은 방법 같아 보입니다.

`pd.cut()`은 **최소에서 최대 구간을 지정한 bin만큼 동일하게 분할** 하기 때문에 이런 현상이 발생할 수 있습니다.

고르게 분포한 데이터라면 괜찮지만, 튀는 **이상치(outlier)가 있는 경우에는 안 좋은 결과**를 초래 합니다.

## pd.qcut() - 동일한 갯수를 갖도록 구간 분할

`pd.cut()`과 유사하지만, **quantity 즉 데이터의 분포를 최대한 비슷하게 유지**하는 구간을 분할 합니다.

In [126]:
# df2의 '운동량' 컬럼에 대해서 데이터의 분포를 최대한 비슷하기 유지하며 10개 구간으로 분할하여
# '운동량_qcut' 이라는 컬럼을 추가합니다.
df2['운동량_qcut'] = pd.qcut(df2['운동량'], 10)

In [127]:
# df2의 '운동량_qcut' 컬럼의 분포를 확인합니다 (구간별 돗수확인)
df2['운동량_qcut'].value_counts().sort_index()

(-0.001, 24.737]           32683
(24.737, 93.414]           32683
(93.414, 192.02]           32690
(192.02, 344.45]           32679
(344.45, 601.705]          32680
(601.705, 1079.744]        32683
(1079.744, 1889.606]       32683
(1889.606, 3328.186]       32683
(3328.186, 6805.188]       32683
(6805.188, 163936052.3]    32683
Name: 운동량_qcut, dtype: int64

구간도 예쁘게 분할(**균등하게 분할**)이 된 것 처럼 보입니다. 하지만, **간격은 일정하지 않습니다.**

In [ ]:
ML
신입사원 - 서류심사 - 재직자(남 - 95%  여 - 5%) 
수치 - 정규분포 (왜도가 심한 경우 - log1p, sqrt, x**2 .... ) X, Y
범주형 - 균등분포